# RasterEnableSnaps Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RasterEnableSnaps Property
ParameterTypeId Class See Also
---
"Enable Snaps"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RasterEnableSnaps { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RasterEnableSnaps As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RasterEnableSnaps {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace